<template>
    <div class="container">
        <ul class="list">
            <li class="list-item">
                Задание 1: <br> "На базе TypeScript разработать компонент, позволяющий делать select разноцветным, с поиском по вариантам. <br> 
                Запрещается использовать готовые компоненты. <br> 
                На каждую запись назначается свой стиль + имеется поиск и автокомплит"
            </li>
            <li class="list-item">
                Задание 2: <br> "Сделать на базе TypeScript тест вопрос/ответ из 4 вопросов.
                На каждый вопрос дается 4 варианта ответа. <br>
                При выборе ответа система подсвечивает правильный ответ зеленым, если пользователь выбрал неправильный ответ, то подсвечивает его красным, а правильный зеленым. <br>
                После прохождения 4 вопросов пишет процент правильных ответов. <br>
                Верстка должна отображаться корректно и адаптивно как на мобильных, так и на планшетах и десктопах. Вопрос и ответы всегда должны умещаться в экран."
            </li>
        </ul>
    </div>
</template>

<style lang="scss" scoped>
    .list{
        &-item {
            font-size: 1.6rem;
            line-height: 2rem;
            margin-bottom: 2rem;
            text-align: left;
        }
    }
</style>